publish/career/cover.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-26 Sun 13:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cover Letter</title>
<meta name="author" content="Ahnaf Siddiqi" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/css/cover.css" />
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Open+Sans">
</head>
<body>
<div id="content" class="content">
<p>
26 January 2025
</p>

<p>
<br/>
</p>

<p>
Ahnaf Siddiqi
</p>

<p>
<br/>
</p>

<p>
<p>+65 97342978,<br/> ahnafsidd@gmail.com
</p>

<p>
<br/>
<br/>
</p>

<p>
Dear Hiring Manager,
</p>

<p>
<br/>
</p>

<p>
I have 5 years of holistic experience from working at a Enterpreneurship First
funded, deep-tech startup. I had the privilege to build multiple aspects of
the companies product, identifying and learning new to tools to fit the
technical requirements. The fast, delivery focused nature of startups has
shaped my work to become adapatable to changing product requirements and
deliver results.
</p>

<p>
<br/>
</p>

<p>
I am involved in multiple projects across two different teams holding the two
key responsibilites: translating stakeholder requests to engineering product
requirements, and supervising junior developers in building the security and
an energy monitoring product. The tech domains I have worked on includes:
network protocol development, core transport layer security [TLS]
implementation for a properietary public key infra using standard cryptography
libraries, standard and real time web microservices, continuous deployment of
applications on aws using docker swarm, cloud and in-house servers.
</p>

<p>
<br/>
</p>

<p>
I have sinced joined Bytedance where for the last 2 years, I'm delivering the
companies Host IDS after they are prepared by the developers. As an SRE, my
duty heavily involves ensure the uptime of a super critical product of the
entire company. Since, joining I have also been able to work on an internal
patent which has since been submitted, albeit only in China.
</p>

<p>
<br/>
</p>

<p>
<span>Tower Research Capital</span> is global and maintaining a high frequency infrastructure at a
large scale is the next step in my career. Understanding the reliable
components of extremely high throughput applications while bringing in my
networking/security knowledge would be an added benefit.
</p>

<p>
<br/>
</p>

<p>
I hope I will be good fit at <span>Tower Research Capital</span>. I can share more of my experience
and elaborate further my experiences that I have over a physical meeting.
</p>

<p>
<br/>
</p>

<p>
Hoping to hear from you soon.
</p>


<p>
<br/>
</p>

<p>
Sincererly, 
</p>

<p>
Ahnaf Siddiqi
</p>
</div>
</body>
</html>
